# IC Intro To Data Visualization with Python Exercise Part 1

## List of Contents:
## 01. Importing Libraries
## 02. Importing Data
## 03. Exploring Customer Data
## 04. Wrangling Data - Renaming Columns
## 05. Wrangling Data - Changing Data Types
## 06. Consistency Checks - Missing Values
## 07. Consistency Checks - Duplicates
## 08. Consistency Checks - Mixed-Type Data
## 09. Preparing Orders_Products_Merged for Merge
## 10. Exporting Data

## --

## 01. Importing Libraries

In [1]:
#Importing libraries
import pandas as pd
import numpy as np
import os

## 02. Importing Data

In [2]:
#Assigning path for import
path = r'C:\Users\Mosspants\Desktop\CareerFoundry\A4_Python_Fundamentals_for_Data_Analysts\Instacart Basket Analysis_10_2023'

In [3]:
#Importing customers data as cust
cust = pd.read_csv(os.path.join(path, '02_Data', 'Original_Data', 'customers.csv'), index_col = False)

## 03. Exploring Customer Data

In [4]:
#Checking description of customers
cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [5]:
#Checking information on customers
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [6]:
#Checking shape of customers
cust.shape

(206209, 10)

In [7]:
#Checking appearance of customers
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 04. Wrangling Data - Renaming Columns

### The column names have different capitalizations and missing words. These have been updated to fit the format of the other data sets (orders, products, etc.)

In [8]:
#Renaming Gender to gender to be consistent with other data sets
cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [9]:
#Renaming First Name to first_name to be consistent with other data sets
cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [10]:
#Renaming Surnam to last_name to be consistent with other data sets
cust.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [11]:
#Renaming STATE to state to be consistent with other data sets
cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [12]:
#Renaming Age to age to be consistent with other data sets
cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [13]:
#Renaming n_dependants to number_of_dependants for clarity
cust.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [14]:
#Renaming fam_status to family_status for clarity
cust.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [15]:
#Checking output after renaming columns
cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 05. Wrangling Data - Changing Data Types

### The user_id is more of an identifying number than an value. The user_id of the other data sets are also strings.

In [16]:
#Changing user_id data type
cust['user_id'] = cust['user_id'].astype('str')

In [17]:
#Checking data type change
cust.dtypes

user_id                 object
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

## 06. Consistency Checks - Missing Values

### Based on dataframe info, first_name has less counts than all other columns. May have missing values.

In [18]:
#Searching for missing values in customers
cust.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
family_status               0
income                      0
dtype: int64

In [19]:
#Creating subset with missing values in first_name
first_name_nan = cust[cust['first_name'].isnull() == True]

In [20]:
first_name_nan

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

### Even though the first name is missing, the rest of the rows have important information. I do not think we need first or last names for analysis, but removing them reduces specificity and could create unintended duplicates. I will leave the null values for now to check for duplicates.

## 07. Consistency Checks - Duplicates

In [21]:
#Creating subset dataframe that will contain duplicates
cust_dups = cust[cust.duplicated()]

In [22]:
cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

### Because there are no duplicates, I will remove first and last name columns and check again to see if that lost of information creates duplicates.

In [23]:
#Creating new dataframe without first_name and last_name
cust_no_name = cust.drop(columns = ['first_name', 'last_name'])

In [24]:
#Checking output of new cust_no_name dataframe
cust_no_name.head()

,user_id,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [25]:
#Checking for duplicates 
cust_no_name_dups = cust_no_name[cust_no_name.duplicated()]

In [26]:
cust_no_name_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

### Removing first and last names does not create any duplicates. I will keep those columns out of the data.

### Upon further review, we do not need gender column as well. Analyasis more focused on age, income, family status, and region.

In [27]:
#Removing gender column from cust_no_name
cust_no_name_2 = cust_no_name.drop(columns = ['gender'])

In [28]:
#Checking for duplicates
cust_no_name_2_dups = cust_no_name_2[cust_no_name_2.duplicated()]

In [29]:
cust_no_name_2_dups

Empty DataFrame
Columns: [user_id, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

## 08. Consistency Checks - Mixed-Type Data

In [30]:
for col in cust_no_name_2.columns.tolist():
    weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
    if len(cust_no_name_2[weird]) > 0:
        print(col)

C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Mosspants\AppData\Local\Temp\ipykernel_12272\2158098540.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (cust_no_name_2[[col]].applymap(type) != cust_no_name_2[[col]].iloc[0].apply(type)).any(axis = 1)

### There is no print output, no mixed data columns.

In [31]:
#Checking data after all changes with describe
cust_no_name_2.describe()

                 age  number_of_dependants         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

In [32]:
#Checking data after all changes with shape
cust_no_name_2.shape

(206209, 7)

In [33]:
#Checking data after all changes with head
cust_no_name_2.head()

,user_id,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Missouri,48,1/1/2017,3,married,165665
1,33890,New Mexico,36,1/1/2017,0,single,59285
2,65803,Idaho,35,1/1/2017,2,married,99568
3,125935,Iowa,40,1/1/2017,0,single,42049
4,130797,Maryland,26,1/1/2017,1,married,40374

In [34]:
#Checking data after all changes with info
cust_no_name_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 7 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  object
 1   state                 206209 non-null  object
 2   age                   206209 non-null  int64
 3   date_joined           206209 non-null  object
 4   number_of_dependants  206209 non-null  int64
 5   family_status         206209 non-null  object
 6   income                206209 non-null  int64
dtypes: int64(3), object(4)
memory usage: 11.0+ MB

# 09. Preparing Orders_Products_Merged for Merge

In [ ]:
#Importing rest of prepared data
ords_prods_merge = pd.read_pickle(os.path.join(path, '02_Data', 'Prepared_Data', 'ords_prods_merge_loyalty.pkl'))

In [ ]:
#Checking data type of ords_prods_merge
ords_prods_merge.info()

In [ ]:
ords_prods_merge.head()

In [ ]:
ords_prods_merge.shape

### Dropping column in orders_products_merged.

In [ ]:
#Dropping busiest_day column. It was replaced with busiest_days.
ords_prods_merge_2 = ords_prods_merge.drop(columns = ['busiest_day'])

In [ ]:
#Checking output after dropped columns
ords_prods_merge_2.shape

In [ ]:
ords_prods_merge_2.head()

# 10. Exporting Data

### Due to memory errors, I will export both dataframes and merge them in a separate notebook.

In [ ]:
#Exporting cust_no_name_2 as customers_checked.pkl
cust_no_name_2.to_pickle(os.path.join(path, '02_Data', 'Prepared_Data', 'customers_checked.pkl'))

In [ ]:
#Exporting ords_prods_merge_3 as orders_products_merged_final.pkl
ords_prods_merge_2.to_pickle(os.path.join(path, '02_Data', 'Prepared_Data', 'orders_products_merged_final.pkl'))